hpmicro/hpm_sdk/soc/HPM6200/ip/hpm_sdp_regs.h
/*
 * AESMOD (RW)
 *
 * AES mode selection.
 * 0x0 = ECB;
 * 0x1 = CBC;
 * Others, reserved.
 */
#define SDP_MODCTRL_AESMOD_MASK (0xF000000UL)
#define SDP_MODCTRL_AESMOD_SHIFT (24U)
#define SDP_MODCTRL_AESMOD_SET(x) (((uint32_t)(x) << SDP_MODCTRL_AESMOD_SHIFT) & SDP_MODCTRL_AESMOD_MASK)
#define SDP_MODCTRL_AESMOD_GET(x) (((uint32_t)(x) & SDP_MODCTRL_AESMOD_MASK) >> SDP_MODCTRL_AESMOD_SHIFT)

/*
 * AESKS (RW)
 *
 * AES Key Selection.
 * These regisgers are being used to select the AES key that stored in the 16x128 key ram of the SDP, or select the key from the OTP. Detail as following:
 * 0x00: key from the 16x128, this is the key read address, valid for AES128; AES256 will use 128 bit from this address and 128 bit key from next address as 256 bit AES key.
 * 0x01: key from the 16x128, this is the key read address, valid for AES128, not valid for AES286.
 * ....
 * 0x0E: key from the 16x128, this is the key read address, valid for AES128; AES256 will use 128 from this add and 128 from next add for the AES key.
 * 0x0F: key from the 16x128, this is the key read address, valid for AES128, not valid for AES286.
 * 0x20: kman_sk0[127:0] from the key manager for AES128; AES256 will use kman_sk0[255:0] as AES key.
 * 0x21: kman_sk0[255:128] from the key manager for AES128; not valid for AES256.
 * 0x22: kman_sk1[127:0] from the key manager for AES128; AES256 will use kman_sk1[255:0] as AES key.
 * 0x23: kman_sk1[255:128] from the key manager for AES128; not valid for AES256.
 * 0x24: kman_sk2[127:0] from the key manager for AES128; AES256 will use kman_sk2[255:0] as AES key.
 * 0x25: kman_sk2[255:128] from the key manager for AES128; not valid for AES256.
 * 0x26: kman_sk3[127:0] from the key manager for AES128; AES256 will use kman_sk3[255:0] as AES key.
 * 0x27: kman_sk3[255:128] from the key manager for AES128; not valid for AES256.
 * 0x30: exip0_key[127:0] from OTP for AES128; AES256 will use exip0_key[255:0] as AES key.
 * 0x31: exip0_key[255:128] from OTP for AES128; not valid for AES256.
 * 0x32: exip1_key[127:0] from OTP for AES128; AES256 will use exip1_key[255:0] as AES key.
 * 0x33: exip1_key[255:128] from OTP for AES128; not valid for AES256.
 * Other values, reserved.
 */
#define SDP_MODCTRL_AESKS_MASK (0xFC0000UL)
#define SDP_MODCTRL_AESKS_SHIFT (18U)
#define SDP_MODCTRL_AESKS_SET(x) (((uint32_t)(x) << SDP_MODCTRL_AESKS_SHIFT) & SDP_MODCTRL_AESKS_MASK)
#define SDP_MODCTRL_AESKS_GET(x) (((uint32_t)(x) & SDP_MODCTRL_AESKS_MASK) >> SDP_MODCTRL_AESKS_SHIFT)

/*
 * AESDIR (RW)
 *
 * AES direction
 * 1x1, AES Decryption
 * 1x0, AES Encryption.
 */
#define SDP_MODCTRL_AESDIR_MASK (0x10000UL)
#define SDP_MODCTRL_AESDIR_SHIFT (16U)
#define SDP_MODCTRL_AESDIR_SET(x) (((uint32_t)(x) << SDP_MODCTRL_AESDIR_SHIFT) & SDP_MODCTRL_AESDIR_MASK)
#define SDP_MODCTRL_AESDIR_GET(x) (((uint32_t)(x) & SDP_MODCTRL_AESDIR_MASK) >> SDP_MODCTRL_AESDIR_SHIFT)

/*
 * HASALG (RW)
 *
 * HASH Algorithem selection.
 * 0x0 SHA1 —
 * 0x1 CRC32 —
 * 0x2 SHA256 —
 */
#define SDP_MODCTRL_HASALG_MASK (0xF000U)
#define SDP_MODCTRL_HASALG_SHIFT (12U)
#define SDP_MODCTRL_HASALG_SET(x) (((uint32_t)(x) << SDP_MODCTRL_HASALG_SHIFT) & SDP_MODCTRL_HASALG_MASK)
#define SDP_MODCTRL_HASALG_GET(x) (((uint32_t)(x) & SDP_MODCTRL_HASALG_MASK) >> SDP_MODCTRL_HASALG_SHIFT)

/*
 * HASCHK (RW)
 *
 * HASH Check Enable Bit.
 * 1x1, HASH check need, hash result will compare with the HASHRSLT 0-7 registers;
 * 1x0, HASH check is not enabled, HASHRSLT0-7 store the HASH result.
 * For SHA1, will use HASHRSLT0-3 words, and HASH 256 will use HASH0-7 words.
 */
#define SDP_MODCTRL_HASCHK_MASK (0x400U)
#define SDP_MODCTRL_HASCHK_SHIFT (10U)
#define SDP_MODCTRL_HASCHK_SET(x) (((uint32_t)(x) << SDP_MODCTRL_HASCHK_SHIFT) & SDP_MODCTRL_HASCHK_MASK)
#define SDP_MODCTRL_HASCHK_GET(x) (((uint32_t)(x) & SDP_MODCTRL_HASCHK_MASK) >> SDP_MODCTRL_HASCHK_SHIFT)

/*
 * HASOUT (RW)
 *
 * When hashing is enabled, this bit controls the input or output data of the AES engine is hashed.
 * 0 INPUT HASH
 * 1 OUTPUT HASH
 */
#define SDP_MODCTRL_HASOUT_MASK (0x200U)
#define SDP_MODCTRL_HASOUT_SHIFT (9U)
#define SDP_MODCTRL_HASOUT_SET(x) (((uint32_t)(x) << SDP_MODCTRL_HASOUT_SHIFT) & SDP_MODCTRL_HASOUT_MASK)
#define SDP_MODCTRL_HASOUT_GET(x) (((uint32_t)(x) & SDP_MODCTRL_HASOUT_MASK) >> SDP_MODCTRL_HASOUT_SHIFT)

/*
 * DINSWP (RW)
 *
 * Decide whether the SDP byteswaps the input data (big-endian data);
 * When all bits are set, the data is assumed to be in the big-endian format
 */
#define SDP_MODCTRL_DINSWP_MASK (0x30U)
#define SDP_MODCTRL_DINSWP_SHIFT (4U)
#define SDP_MODCTRL_DINSWP_SET(x) (((uint32_t)(x) << SDP_MODCTRL_DINSWP_SHIFT) & SDP_MODCTRL_DINSWP_MASK)
#define SDP_MODCTRL_DINSWP_GET(x) (((uint32_t)(x) & SDP_MODCTRL_DINSWP_MASK) >> SDP_MODCTRL_DINSWP_SHIFT)

/*
 * DOUTSWP (RW)
 *
 * Decide whether the SDP byteswaps the output data (big-endian data); When all bits are set, the data is assumed to be in the big-endian format
 */
#define SDP_MODCTRL_DOUTSWP_MASK (0xCU)
#define SDP_MODCTRL_DOUTSWP_SHIFT (2U)
#define SDP_MODCTRL_DOUTSWP_SET(x) (((uint32_t)(x) << SDP_MODCTRL_DOUTSWP_SHIFT) & SDP_MODCTRL_DOUTSWP_MASK)
#define SDP_MODCTRL_DOUTSWP_GET(x) (((uint32_t)(x) & SDP_MODCTRL_DOUTSWP_MASK) >> SDP_MODCTRL_DOUTSWP_SHIFT)

/*
 * KEYSWP (RW)
 *
 * Decide whether the SDP byteswaps the Key (big-endian data).
 * When all bits are set, the data is assumed to be in the big-endian format
 */
#define SDP_MODCTRL_KEYSWP_MASK (0x3U)
#define SDP_MODCTRL_KEYSWP_SHIFT (0U)
#define SDP_MODCTRL_KEYSWP_SET(x) (((uint32_t)(x) << SDP_MODCTRL_KEYSWP_SHIFT) & SDP_MODCTRL_KEYSWP_MASK)
#define SDP_MODCTRL_KEYSWP_GET(x) (((uint32_t)(x) & SDP_MODCTRL_KEYSWP_MASK) >> SDP_MODCTRL_KEYSWP_SHIFT)

/* Bitfield definition for register: PKTCNT */
/*
 * CNTVAL (RO)
 *
 * This read-only field shows the current (instantaneous) value of the packet counter
 */
#define SDP_PKTCNT_CNTVAL_MASK (0xFF0000UL)
#define SDP_PKTCNT_CNTVAL_SHIFT (16U)
#define SDP_PKTCNT_CNTVAL_GET(x) (((uint32_t)(x) & SDP_PKTCNT_CNTVAL_MASK) >> SDP_PKTCNT_CNTVAL_SHIFT)

